Hi @kiranchavala. Thanks for picking up this project.

I gave this provider a try on Apache CloudStack 4.18.1 but seem to have some issues. I compiled the provider with the [most recent commits on the main branch](https://github.com/apache/cloudstack-terraform-provider/commit/e6079512a317cf2778f9bd6d5d08981df10c0ad6) at the time of this message and have the following results.

```
$ terraform -v
Terraform v1.7.4
on linux_amd64
+ provider registry.terraform.io/cloudstack/cloudstack v0.4.1
```
0.4.1 is what I versioned the compiled plugin to avoid confusing it with the 0.4.0 release.


Here's what I defined in my project:
```
resource "cloudstack_ipaddress" "galaxy_public_ip" {
    vpc_id = "${cloudstack_vpc.default.id}"
    network_id = "${cloudstack_network.galaxy-net.id}"
    zone = "zone1"
    project = "${var.cloudstack_project_id}"
}
```

When I apply it, I see:

```
Terraform will perform the following actions:

  # cloudstack_ipaddress.galaxy_public_ip will be created
  + resource "cloudstack_ipaddress" "galaxy_public_ip" {
      + id            = (known after apply)
      + ip_address    = (known after apply)
      + is_portable   = false
      + is_source_nat = (known after apply)
      + network_id    = "5282446c-a837-48a2-9e77-d3add3cfc6df"
      + project       = "d037175d-b0bc-4aaa-801b-a1a7557b4b94"
      + tags          = (known after apply)
      + vpc_id        = "38652dce-c027-4a2c-b747-0a799ec97923"
      + zone          = "zone1"
    }

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

cloudstack_ipaddress.galaxy_public_ip: Creating...
cloudstack_ipaddress.galaxy_public_ip: Creation complete after 1s [id=85010dc9-87e9-4f52-9ba3-3e107ea37d70]

```

When I look at the terraform tfstate file, network_id is still missing:

```
    {
      "mode": "managed",
      "type": "cloudstack_ipaddress",
      "name": "galaxy_public_ip",
      "provider": "provider[\"registry.terraform.io/cloudstack/cloudstack\"]",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "id": "85010dc9-87e9-4f52-9ba3-3e107ea37d70",
            "ip_address": "10.44.122.76",
            "is_portable": false,
            "is_source_nat": false,
            "network_id": "",
            "project": "d037175d-b0bc-4aaa-801b-a1a7557b4b94",
            "tags": {},
            "vpc_id": "38652dce-c027-4a2c-b747-0a799ec97923",
            "zone": "zone1"
          },
```
